---
type: SynchronizeWithCentralOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 15
tags: [revit-api, class]
---

# SynchronizeWithCentralOptions

`Autodesk.Revit.DB.SynchronizeWithCentralOptions` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SynchronizeWithCentralOptions | 2014 | `public SynchronizeWithCentralOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetRelinquishOptions | 2014 | `public RelinquishOptions GetRelinquishOptions ()` |
| Method | SetRelinquishOptions | 2014 | `public void SetRelinquishOptions ( RelinquishOptions relinquishOptions )` |
| Property | Comment | 2014 | `public string Comment { get ; set ; }` |
| Property | Compact | 2014 | `public bool Compact { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | RelinquishBorrowedElements | 2014 | `public bool RelinquishBorrowedElements { get ; }` |
| Property | RelinquishFamilyWorksets | 2014 | `public bool RelinquishFamilyWorksets { get ; }` |
| Property | RelinquishProjectStandardWorksets | 2014 | `public bool RelinquishProjectStandardWorksets { get ; }` |
| Property | RelinquishUserCreatedWorksets | 2014 | `public bool RelinquishUserCreatedWorksets { get ; }` |
| Property | RelinquishViewWorksets | 2014 | `public bool RelinquishViewWorksets { get ; }` |
| Property | SaveLocalAfter | 2014 | `public bool SaveLocalAfter { get ; set ; }` |
| Property | SaveLocalBefore | 2014 | `public bool SaveLocalBefore { get ; set ; }` |
| Property | SaveLocalFile | 2014 | `public bool SaveLocalFile { get ; }` |